       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
       AUTHOR. TEST-AUTHOR.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. X8086.
       OBJECT-COMPUTER. X8086.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  COUNTER     PIC 9(4)  VALUE ZERO.
       01  FILLER      PIC X(10).
       01  RESULT-DATA.
           05  RESULT  PIC 9(4)  VALUE ZERO.
           05  FILLER  PIC X(5).

       PROCEDURE DIVISION.
       MAIN-LOGIC SECTION.
           PERFORM INIT-ROUTINE
           PERFORM PROCESS-DATA UNTIL COUNTER > 100
           PERFORM END-ROUTINE
           STOP RUN.

       INIT-ROUTINE SECTION.
           MOVE ZERO TO COUNTER
           MOVE SPACES TO RESULT-DATA.

       PROCESS-DATA SECTION.
           ADD 1 TO COUNTER
           IF COUNTER = 50
               GOTO SKIP-PROCESS
           END-IF
           MOVE COUNTER TO RESULT
           DISPLAY RESULT.
       SKIP-PROCESS.
           EXIT.

       END-ROUTINE SECTION.
           DISPLAY "PROCESSING COMPLETE"
           EXIT. 